.config/emacs/config.org
#+property: header-args :results silent :tangle yes :comments both
#+title: My Emacs Config 
#+author: Kay Kaprolat
This file contains my Emacs configuration.
Important sources are:
- https://github.com/thomasheartman/.emacs.d/blob/develop/config.org
- https://emacsdocs.org/docs/elisp/Emacs-Lisp

* General Options
Not loading ~bind-key~ early caused error messages, so do that right away.
#+begin_src emacs-lisp
  (require 'bind-key)
#+end_src
Since I use ~use-package~ for all my packages and don't want to repeat ~:ensure t~ everywhere, I set the following:
#+begin_src emacs-lisp
  (require 'use-package-ensure)
  (setq use-package-always-ensure t)
#+end_src
** Interface Theme
For the overall theme, I use catppuccin.
This has to be loaded early since I use some of it's variables occasionally.
Note that when reinstalling via Emacs, it couldn't install ~catppuccin-theme~ for some reason.
Installing that via ~M-x package-install~ fixed that.
#+begin_src emacs-lisp
  (use-package catppuccin-theme
    :init
#+end_src
The two ~t~ parameters when loading it are necessary for customization.
#+begin_src emacs-lisp
  (load-theme 'catppuccin t t)
#+end_src
And I want to use the moccha flavor.
#+begin_src emacs-lisp
  (setq catppuccin-flavor 'mocha)
  (catppuccin-reload)
  )
#+end_src

Furthermore, the whole interface should be slightly transparent.
Unfortunately, this also makes the menu bar transparent.
#+begin_src emacs-lisp
  (set-frame-parameter nil 'alpha-background 85)
  (add-to-list 'default-frame-alist '(alpha-background . 85))
#+end_src


** Cleanliness
First of all, as all options should only ever be in this file, all customizations should be saved to ~/tmp~ to be easily discarded.
#+begin_src emacs-lisp
  (setq custom-file (make-temp-name "/tmp/"))
#+end_src

I also dislike Emacs' cluttering of directories with backup files (i.e. files ending with ~~~).
Instead, all these files should be moved to a single directory.
#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/.cache/emacs_backups")))
#+end_src

** Package Setup
For some settings it is also useful to know whether we are running under NixOS.
This can be tested by checking whether ~NIX_PATH~ is set in ~initial-environment~ or ~process-environment~.
#+begin_src emacs-lisp
  (defvar my/running-under-nix (if (seq-find (lambda (x) (string-prefix-p "NIX_PATH" x)) initial-environment)
                                   t
                                 nil)
    "Whether the editor runs in a Nix environment, making some package operations unnecessary.")
#+end_src


For example, when not using NixOS, most packages have to be retrieved from MELPA.
As such, that configuration is added here.
#+begin_src emacs-lisp
  (when (not my/running-under-nix)
       (require 'package)
       (add-to-list 'package-archives
                    '("melpa" . "https://melpa.org/packages/") t)
       (package-initialize)
  )
#+end_src

Furthermore, since Nix automatically installs every package requested, and since I don't like repeating src_emacs-lisp[]{:ensure t} all over the place, I set ~use-package-always-ensure~.
#+begin_src emacs-lisp :tangle yes
  (when (not my/running-under-nix)
    (require 'use-package-ensure)
    (setq use-package-always-ensure t)
    )
#+end_src

** Basic Editor Setup
*** Performance
Setting the garbage collection threshold higher (100MB in this case) may fix some performance problems.
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 100 1024 1024))
#+end_src

When using ~doom-modeline~, some issues can be fixed with the following.
#+begin_src emacs-lisp
  (setq inhibit-compacting-font-caches t)
#+end_src

When using LSP, this is required to read large data blobs (1MB).
#+begin_src emacs-lisp
  (setq read-process-output-max (* 1024 1024))
#+end_src

*** Indentation
By default, indent with two spaces.
#+begin_src  emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)
  (setq standard-indent 2)
#+end_src

*** Encoding
Always use UTF-8.
#+begin_src emacs-lisp
  (set-charset-priority 'unicode)
  (prefer-coding-system 'utf-8-unix)
#+end_src

*** Dired
Dired should be automatically refreshed when files are changed.
#+begin_src emacs-lisp
  (setq dired-do-revert-buffer t)
#+end_src

* Interface
** Interface and Integration
*** "Console-Like"
Since I want to use Emacs mostly as a "console-like" native application, I always want to be prompted in the minibuffer and not in dialog boxes.
#+begin_src emacs-lisp
  (setq use-dialog-box nil)
#+end_src

Also, no tool bar or scroll bar.
#+begin_src emacs-lisp
  ;(when (window-system)
    (tool-bar-mode -1)
    (setq tool-bar-mode nil)
    (scroll-bar-mode -1)
    (setq scroll-bar-mode nil)
#+end_src

At some point, I may also remove the menu bar on top.
#+begin_src emacs-lisp
  ; (menu-bar-mode -1)
  ; (setq menu-bar-mode nil)
  ;)
#+end_src

*** Scrolling
I like smooth scrolling with my mouse or trackpad.
#+begin_src emacs-lisp
  (pixel-scroll-precision-mode)
  (setq pixel-scroll-precision-interpolate-page t)
#+end_src

While this breaks in evil mode, it can still be used for animations using [[https://codeberg.org/ideasman42/emacs-scroll-on-jump][scroll-on-jump]].
#+begin_src emacs-lisp
  (use-package scroll-on-jump
    :custom
    (scroll-on-jump-duration 0.6)
    (scroll-on-jump-curve 'linear)
    )
#+end_src

*** Windows
Speaking of the mouse, I want windows to be switched automatically when hovering with the mouse.
#+begin_src emacs-lisp
  (setq mouse-autoselect-window t)
#+end_src

Furthermore, the help window should be selected immediately, as I probably want to close it after reading.
#+begin_src emacs-lisp
  (setq help-window-select t)
#+end_src

*** Line Numbers
Display line numbers in most relevant modes:
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (add-hook 'org-mode-hook  'display-line-numbers-mode)
  (dolist (mode '(pdf-view-mode-hook
                  term-mode-hook
                  eshell-mode-hook
                  vterm-mode-hook
                  imenu-list-minor-mode-hook
                  imenu-list-major-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode -1))))
#+end_src

This actually causes weird behaviour when scrolling, as the width automatically changes with the needed number size.
This can be fixed using the following [[https://emacs.stackexchange.com/questions/55165/uneven-line-numbers-with-display-line-numbers][snippet from StackExchange]].
#+begin_src emacs-lisp
  (defun display-line-numbers-equalize ()
    "Equalize Line Number Width"
    (setq display-line-numbers-width (length (number-to-string (line-number-at-pos (point-max)))))
    )
  (add-hook 'find-file-hook 'display-line-numbers-equalize)
#+end_src

Display line and column number in the mode line.
#+begin_src emacs-lisp
  (column-number-mode)
#+end_src

*** Lines
Always wrap lines, as I don't like scrolling horizontally.
#+begin_src emacs-lisp
  (global-visual-line-mode)
#+end_src

The current line should be highlighted in programming and text mode.
#+begin_src emacs-lisp
  (require 'hl-line)
  (add-hook 'prog-mode-hook #'hl-line-mode)
  (add-hook 'text-mode-hook #'hl-line-mode)
#+end_src

