.config/emacs/config.el
;; General Options
;; Not loading ~bind-key~ early caused error messages, so do that right away.

;; [[file:config.org::*General Options][General Options:1]]
(require 'bind-key)
;; General Options:1 ends here


;; Since I use ~use-package~ for all my packages and don't want to repeat ~:ensure t~ everywhere, I set the following:

;; [[file:config.org::*General Options][General Options:2]]
(require 'use-package-ensure)
(setq use-package-always-ensure t)
;; General Options:2 ends here

;; Interface Theme
;; For the overall theme, I use catppuccin.
;; This has to be loaded early since I use some of it's variables occasionally.
;; Note that when reinstalling via Emacs, it couldn't install ~catppuccin-theme~ for some reason.
;; Installing that via ~M-x package-install~ fixed that.

;; [[file:config.org::*Interface Theme][Interface Theme:1]]
(use-package catppuccin-theme
  :init
;; Interface Theme:1 ends here


;; The two ~t~ parameters when loading it are necessary for customization.

;; [[file:config.org::*Interface Theme][Interface Theme:2]]
(load-theme 'catppuccin t t)
;; Interface Theme:2 ends here


;; And I want to use the moccha flavor.

;; [[file:config.org::*Interface Theme][Interface Theme:3]]
(setq catppuccin-flavor 'mocha)
(catppuccin-reload)
)
;; Interface Theme:3 ends here



;; Furthermore, the whole interface should be slightly transparent.
;; Unfortunately, this also makes the menu bar transparent.

;; [[file:config.org::*Interface Theme][Interface Theme:4]]
(set-frame-parameter nil 'alpha-background 85)
(add-to-list 'default-frame-alist '(alpha-background . 85))
;; Interface Theme:4 ends here

;; Cleanliness
;; First of all, as all options should only ever be in this file, all customizations should be saved to ~/tmp~ to be easily discarded.

;; [[file:config.org::*Cleanliness][Cleanliness:1]]
(setq custom-file (make-temp-name "/tmp/"))
;; Cleanliness:1 ends here



;; I also dislike Emacs' cluttering of directories with backup files (i.e. files ending with ~~~).
;; Instead, all these files should be moved to a single directory.

;; [[file:config.org::*Cleanliness][Cleanliness:2]]
(setq backup-directory-alist '(("." . "~/.cache/emacs_backups")))
;; Cleanliness:2 ends here

;; Package Setup
;; For some settings it is also useful to know whether we are running under NixOS.
;; This can be tested by checking whether ~NIX_PATH~ is set in ~initial-environment~ or ~process-environment~.

;; [[file:config.org::*Package Setup][Package Setup:1]]
(defvar my/running-under-nix (if (seq-find (lambda (x) (string-prefix-p "NIX_PATH" x)) initial-environment)
                                 t
                               nil)
  "Whether the editor runs in a Nix environment, making some package operations unnecessary.")
;; Package Setup:1 ends here




;; For example, when not using NixOS, most packages have to be retrieved from MELPA.
;; As such, that configuration is added here.

;; [[file:config.org::*Package Setup][Package Setup:2]]
(when (not my/running-under-nix)
     (require 'package)
     (add-to-list 'package-archives
                  '("melpa" . "https://melpa.org/packages/") t)
     (package-initialize)
)
;; Package Setup:2 ends here



;; Furthermore, since Nix automatically installs every package requested, and since I don't like repeating src_emacs-lisp[]{:ensure t} all over the place, I set ~use-package-always-ensure~.

;; [[file:config.org::*Package Setup][Package Setup:3]]
(when (not my/running-under-nix)
  (require 'use-package-ensure)
  (setq use-package-always-ensure t)
  )
;; Package Setup:3 ends here

;; Performance
;; Setting the garbage collection threshold higher (100MB in this case) may fix some performance problems.

;; [[file:config.org::*Performance][Performance:1]]
(setq gc-cons-threshold (* 100 1024 1024))
;; Performance:1 ends here



;; When using ~doom-modeline~, some issues can be fixed with the following.

;; [[file:config.org::*Performance][Performance:2]]
(setq inhibit-compacting-font-caches t)
;; Performance:2 ends here



;; When using LSP, this is required to read large data blobs (1MB).

;; [[file:config.org::*Performance][Performance:3]]
(setq read-process-output-max (* 1024 1024))
;; Performance:3 ends here

;; Indentation
;; By default, indent with two spaces.

;; [[file:config.org::*Indentation][Indentation:1]]
(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)
(setq standard-indent 2)
;; Indentation:1 ends here

;; Encoding
;; Always use UTF-8.

;; [[file:config.org::*Encoding][Encoding:1]]
(set-charset-priority 'unicode)
(prefer-coding-system 'utf-8-unix)
;; Encoding:1 ends here

;; Dired
;; Dired should be automatically refreshed when files are changed.

;; [[file:config.org::*Dired][Dired:1]]
(setq dired-do-revert-buffer t)
;; Dired:1 ends here

;; "Console-Like"
;; Since I want to use Emacs mostly as a "console-like" native application, I always want to be prompted in the minibuffer and not in dialog boxes.

;; [[file:config.org::*"Console-Like"]["Console-Like":1]]
(setq use-dialog-box nil)
;; "Console-Like":1 ends here



;; Also, no tool bar or scroll bar.

;; [[file:config.org::*"Console-Like"]["Console-Like":2]]
;(when (window-system)
  (tool-bar-mode -1)
  (setq tool-bar-mode nil)
  (scroll-bar-mode -1)
  (setq scroll-bar-mode nil)
;; "Console-Like":2 ends here



;; At some point, I may also remove the menu bar on top.

;; [[file:config.org::*"Console-Like"]["Console-Like":3]]
; (menu-bar-mode -1)
; (setq menu-bar-mode nil)
;)
;; "Console-Like":3 ends here

;; Scrolling
;; I like smooth scrolling with my mouse or trackpad.

;; [[file:config.org::*Scrolling][Scrolling:1]]
(pixel-scroll-precision-mode)
(setq pixel-scroll-precision-interpolate-page t)
;; Scrolling:1 ends here



;; While this breaks in evil mode, it can still be used for animations using [[https://codeberg.org/ideasman42/emacs-scroll-on-jump][scroll-on-jump]].

;; [[file:config.org::*Scrolling][Scrolling:2]]
(use-package scroll-on-jump
  :custom
  (scroll-on-jump-duration 0.6)
  (scroll-on-jump-curve 'linear)
  )
;; Scrolling:2 ends here

;; Windows
;; Speaking of the mouse, I want windows to be switched automatically when hovering with the mouse.

;; [[file:config.org::*Windows][Windows:1]]
(setq mouse-autoselect-window t)
;; Windows:1 ends here



;; Furthermore, the help window should be selected immediately, as I probably want to close it after reading.

;; [[file:config.org::*Windows][Windows:2]]
(setq help-window-select t)
;; Windows:2 ends here

;; Line Numbers
;; Display line numbers in most relevant modes:

;; [[file:config.org::*Line Numbers][Line Numbers:1]]
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'org-mode-hook  'display-line-numbers-mode)
(dolist (mode '(pdf-view-mode-hook
                term-mode-hook
                eshell-mode-hook
                vterm-mode-hook
                imenu-list-minor-mode-hook
                imenu-list-major-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode -1))))
;; Line Numbers:1 ends here



;; This actually causes weird behaviour when scrolling, as the width automatically changes with the needed number size.
;; This can be fixed using the following [[https://emacs.stackexchange.com/questions/55165/uneven-line-numbers-with-display-line-numbers][snippet from StackExchange]].

;; [[file:config.org::*Line Numbers][Line Numbers:2]]
(defun display-line-numbers-equalize ()
  "Equalize Line Number Width"
  (setq display-line-numbers-width (length (number-to-string (line-number-at-pos (point-max)))))
  )
(add-hook 'find-file-hook 'display-line-numbers-equalize)
;; Line Numbers:2 ends here



;; Display line and column number in the mode line.

;; [[file:config.org::*Line Numbers][Line Numbers:3]]
(column-number-mode)
;; Line Numbers:3 ends here

;; Lines
;; Always wrap lines, as I don't like scrolling horizontally.

;; [[file:config.org::*Lines][Lines:1]]
(global-visual-line-mode)
;; Lines:1 ends here



;; The current line should be highlighted in programming and text mode.

;; [[file:config.org::*Lines][Lines:2]]
(require 'hl-line)
(add-hook 'prog-mode-hook #'hl-line-mode)
(add-hook 'text-mode-hook #'hl-line-mode)
;; Lines:2 ends here

;; Minibuffer
