.config/emacs/config.org
*** Indentation Guides
For indentation guides, I used [[https://github.com/lukas-reineke/indent-blankline.nvim][indent-blankline.nvim]] in the past.
With Emacs, this functionality is provided e.g. by [[https://github.com/DarthFennec/highlight-indent-guides][highlight-indent-guides]].
However, that package did not work on blank lines.
I wanted to use [[https://github.com/jdtsmith/indent-bars][indent-bars]], however that requires [[https://github.com/radian-software/straight.el][straight]] which was too cumbersome to set up.
As such, I'll just not use indentation guides until I find a better solution.

*** Minibuffer
Retain minibuffer history.
#+begin_src emacs-lisp
  (savehist-mode)
#+end_src

*** Miscellaneous
Sentences should obviously only end with one space after the period.
#+begin_src emacs-lisp
  (setq sentence-end-double-space nil)
#+end_src

I cannot fix any issues with native compilation as I don't own any of the plugins I use.
As such, these warnings are disabled.
#+begin_src emacs-lisp
  (setq native-comp-async-report-warnings-errors 'silent)
#+end_src

The clipboard should stay in the kill ring before replacing it.
#+begin_src emacs-lisp
  (setq save-interprogram-paste-before-kill t)
#+end_src

** Fonts and Faces
As the default font, /Iosevka/ in Size 11 is sufficient.
#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Iosevka-11")
  (add-to-list 'default-frame-alist '(font . "Iosevka-11"))
#+end_src

Additionally, comments should be italic.
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-comment-face nil :slant 'italic)
#+end_src

Furthermore, the default highlighting for line numbers was too dim for my taste, so let's change it to Catppuccin's ~overlay2~.
The current line should furthermore be bold and yellow.
#+begin_src emacs-lisp
  (set-face-attribute 'line-number nil :foreground (alist-get 'overlay2 catppuccin-mocha-colors))
  (set-face-attribute 'line-number-current-line nil :foreground (alist-get 'lavender catppuccin-mocha-colors) :weight 'heavy)
#+end_src

I also like ligatures.
Using the [[https://github.com/mickeynp/ligature.el][ligature]] package allows setting specific ligatures for specific modes.
Note, that since we use the treesitter modes (configured later), these have to be specified here instead of the default ones.
The ~www~ ligature should be used everywhere, and other ligatures should be language-specific.
Possible ligatures are taken from the [[https://typeof.net/Iosevka/][Iosevka website]].
I omitted the ~/*~ and ~*/~ ligatures, as they look bad in my opinion.
#+begin_src emacs-lisp
  (use-package ligature
    :config
    (ligature-set-ligatures 't '("www"))

    (ligature-set-ligatures 'python-ts-mode  '("<=" "=>" ">=" "__"  "==" "!="  "->" "<-"))
    (ligature-set-ligatures 'c-ts-mode       '("<<=" "<=" ">=" ">>=" "::" ":::" "==" "!="
                                               "*="  "++"))
    (ligature-set-ligatures 'js-ts-mode       '("->" "->>" "-->" "--->" "<<=" "<=" "=>"
                                                "=>>" "==>" "===>" ">=" ">>=" "<->" "<=>"
                                                "::" ":::" "__" "</" "</>" "/>" "~~>" "=="
                                                "!=" "<>" "===" "!==" "!===" "*=" "<|" "<|>"
                                                "|>" "++" "+++" "<!--" "<!---"))
    (global-ligature-mode t)
    )
#+end_src

** Modeline
I like the look of [[https://github.com/seagle0128/doom-modeline][doom-modeline]], which requires [[https://github.com/rainstormstudio/nerd-icons.el][nerd-icons]].
Also, I enable a bunch of interesting information in the modeline.
#+begin_src emacs-lisp
  (use-package doom-modeline
    :custom
    (doom-modeline-support-imenu t)
    (doom-modeline-height 35)
    (doom-modeline-minor-modes t)
    (doom-modeline-enable-word-count t)
    (doom-modeline-indent-info t)
    (doom-modeline-check-simple-format t)
    (doom-modeline-time t)
    (doom-modeline-time-icon nil)
    (doom-modeline-time-live-icon nil)
    (doom-modeline-time-analogue-clock nil)
    :init (doom-modeline-mode 1)
    )
  (use-package nerd-icons)
#+end_src

Even with the Nerd Font correctly installed, some icons such as 💡 are not displayed.
Unfortunately, that icon is used in the mode line.
We can set a fallback, however:
#+begin_src emacs-lisp :tangle yes
  (setq lsp-modeline-code-action-fallback-icon " ")
#+end_src

Further information has to be enabled with minor modes.
The file size:
#+begin_src emacs-lisp
  (size-indication-mode)
#+end_src
The time, with an attempt to hide the CPU information:
#+begin_src emacs-lisp
  (setq display-time-24hr-format t)
  (setq display-time-default-load-average nil)
  (display-time-mode)
#+end_src

Over time, minor modes started cluttering up my modeline.
This can be fixed by using e.g. [[https://github.com/tarsius/minions][minions]], which ~doom-modeline~ explicitly supports.
#+begin_src emacs-lisp
  (use-package minions
    :init
    (minions-mode)
    )
#+end_src

** Dashboard
Using [[https://github.com/emacs-dashboard/emacs-dashboard][emacs-dashboard]], the dashboard can be improved a bit.
#+begin_src emacs-lisp
  (use-package dashboard
  :custom
  (dashboard-banner-logo-title "Hallo Kay!")
  (dashboard-center-content t)
  (dashboard-navigation-cycle t)
  (dashboard-heading-shorcut-format " [%s]")  ; yes, it is shor_cut, not shor*t*cut
  (dashboard-display-icons-p t)
  (dashboard-icon-type 'nerd-icons)
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-startup-banner "/home/kay/Pictures/Header.webp")
  (dashboard-banner-ascii
#+end_src
I use the following ASCII art image:
#+begin_src emacs-lisp
  "
  blablablub
  blubbediblub
  "
#+end_src
#+begin_src emacs-lisp
  )
  :config
  (add-hook 'dashboard-mode-hook (lambda () (setq-local mode-line-format nil)))
  (add-to-list 'doom-modeline-mode-alist '(dashboard-mode . 'nil)) ; disable the doom modeline on the dashboard
  (dashboard-setup-startup-hook)
#+end_src
Interestingly, using ~emacs-dashboard~ causes ~emacs --daemon~ to not work.
This can be fixed by setting the following (see Issue [[https://github.com/emacs-dashboard/emacs-dashboard/issues/373][#373]])
#+begin_src emacs-lisp
  :hook (server-after-make-frame . dashboard-refresh-buffer)
  )
#+end_src
* Keybinds
** Evil Mode
