.config/emacs/config.el
;; Retain minibuffer history.

;; [[file:config.org::*Minibuffer][Minibuffer:1]]
(savehist-mode)
;; Minibuffer:1 ends here

;; Miscellaneous
;; Sentences should obviously only end with one space after the period.

;; [[file:config.org::*Miscellaneous][Miscellaneous:1]]
(setq sentence-end-double-space nil)
;; Miscellaneous:1 ends here



;; I cannot fix any issues with native compilation as I don't own any of the plugins I use.
;; As such, these warnings are disabled.

;; [[file:config.org::*Miscellaneous][Miscellaneous:2]]
(setq native-comp-async-report-warnings-errors 'silent)
;; Miscellaneous:2 ends here



;; The clipboard should stay in the kill ring before replacing it.

;; [[file:config.org::*Miscellaneous][Miscellaneous:3]]
(setq save-interprogram-paste-before-kill t)
;; Miscellaneous:3 ends here

;; Fonts and Faces
;; As the default font, /Iosevka/ in Size 11 is sufficient.

;; [[file:config.org::*Fonts and Faces][Fonts and Faces:1]]
(set-face-attribute 'default nil :font "Iosevka-11")
(add-to-list 'default-frame-alist '(font . "Iosevka-11"))
;; Fonts and Faces:1 ends here



;; Additionally, comments should be italic.

;; [[file:config.org::*Fonts and Faces][Fonts and Faces:2]]
(set-face-attribute 'font-lock-comment-face nil :slant 'italic)
;; Fonts and Faces:2 ends here



;; Furthermore, the default highlighting for line numbers was too dim for my taste, so let's change it to Catppuccin's ~overlay2~.
;; The current line should furthermore be bold and yellow.

;; [[file:config.org::*Fonts and Faces][Fonts and Faces:3]]
(set-face-attribute 'line-number nil :foreground (alist-get 'overlay2 catppuccin-mocha-colors))
(set-face-attribute 'line-number-current-line nil :foreground (alist-get 'lavender catppuccin-mocha-colors) :weight 'heavy)
;; Fonts and Faces:3 ends here



;; I also like ligatures.
;; Using the [[https://github.com/mickeynp/ligature.el][ligature]] package allows setting specific ligatures for specific modes.
;; Note, that since we use the treesitter modes (configured later), these have to be specified here instead of the default ones.
;; The ~www~ ligature should be used everywhere, and other ligatures should be language-specific.
;; Possible ligatures are taken from the [[https://typeof.net/Iosevka/][Iosevka website]].
;; I omitted the ~/*~ and ~*/~ ligatures, as they look bad in my opinion.

;; [[file:config.org::*Fonts and Faces][Fonts and Faces:4]]
(use-package ligature
  :config
  (ligature-set-ligatures 't '("www"))

  (ligature-set-ligatures 'python-ts-mode  '("<=" "=>" ">=" "__"  "==" "!="  "->" "<-"))
  (ligature-set-ligatures 'c-ts-mode       '("<<=" "<=" ">=" ">>=" "::" ":::" "==" "!="
                                             "*="  "++"))
  (ligature-set-ligatures 'js-ts-mode       '("->" "->>" "-->" "--->" "<<=" "<=" "=>"
                                              "=>>" "==>" "===>" ">=" ">>=" "<->" "<=>"
                                              "::" ":::" "__" "</" "</>" "/>" "~~>" "=="
                                              "!=" "<>" "===" "!==" "!===" "*=" "<|" "<|>"
                                              "|>" "++" "+++" "<!--" "<!---"))
  (global-ligature-mode t)
  )
;; Fonts and Faces:4 ends here

;; Modeline
;; I like the look of [[https://github.com/seagle0128/doom-modeline][doom-modeline]], which requires [[https://github.com/rainstormstudio/nerd-icons.el][nerd-icons]].
;; Also, I enable a bunch of interesting information in the modeline.

;; [[file:config.org::*Modeline][Modeline:1]]
(use-package doom-modeline
  :custom
  (doom-modeline-support-imenu t)
  (doom-modeline-height 35)
  (doom-modeline-minor-modes t)
  (doom-modeline-enable-word-count t)
  (doom-modeline-indent-info t)
  (doom-modeline-check-simple-format t)
  (doom-modeline-time t)
  (doom-modeline-time-icon nil)
  (doom-modeline-time-live-icon nil)
  (doom-modeline-time-analogue-clock nil)
  :init (doom-modeline-mode 1)
  )
(use-package nerd-icons)
;; Modeline:1 ends here



;; Even with the Nerd Font correctly installed, some icons such as 💡 are not displayed.
;; Unfortunately, that icon is used in the mode line.
;; We can set a fallback, however:

;; [[file:config.org::*Modeline][Modeline:2]]
(setq lsp-modeline-code-action-fallback-icon " ")
;; Modeline:2 ends here



;; Further information has to be enabled with minor modes.
;; The file size:

;; [[file:config.org::*Modeline][Modeline:3]]
(size-indication-mode)
;; Modeline:3 ends here


;; The time, with an attempt to hide the CPU information:

;; [[file:config.org::*Modeline][Modeline:4]]
(setq display-time-24hr-format t)
(setq display-time-default-load-average nil)
(display-time-mode)
;; Modeline:4 ends here



;; Over time, minor modes started cluttering up my modeline.
;; This can be fixed by using e.g. [[https://github.com/tarsius/minions][minions]], which ~doom-modeline~ explicitly supports.

;; [[file:config.org::*Modeline][Modeline:5]]
(use-package minions
  :init
  (minions-mode)
  )
;; Modeline:5 ends here

;; Dashboard
;; Using [[https://github.com/emacs-dashboard/emacs-dashboard][emacs-dashboard]], the dashboard can be improved a bit.

;; [[file:config.org::*Dashboard][Dashboard:1]]
(use-package dashboard
:custom
(dashboard-banner-logo-title "Hallo Kay!")
(dashboard-center-content t)
(dashboard-navigation-cycle t)
(dashboard-heading-shorcut-format " [%s]")  ; yes, it is shor_cut, not shor*t*cut
(dashboard-display-icons-p t)
(dashboard-icon-type 'nerd-icons)
(dashboard-set-heading-icons t)
(dashboard-set-file-icons t)
(dashboard-startup-banner "/home/kay/Pictures/Header.webp")
(dashboard-banner-ascii
;; Dashboard:1 ends here


;; I use the following ASCII art image:

;; [[file:config.org::*Dashboard][Dashboard:2]]
"
blablablub
blubbediblub
"
;; Dashboard:2 ends here

;; [[file:config.org::*Dashboard][Dashboard:3]]
)
:config
(add-hook 'dashboard-mode-hook (lambda () (setq-local mode-line-format nil)))
(add-to-list 'doom-modeline-mode-alist '(dashboard-mode . 'nil)) ; disable the doom modeline on the dashboard
(dashboard-setup-startup-hook)
;; Dashboard:3 ends here


;; Interestingly, using ~emacs-dashboard~ causes ~emacs --daemon~ to not work.
;; This can be fixed by setting the following (see Issue [[https://github.com/emacs-dashboard/emacs-dashboard/issues/373][#373]])

;; [[file:config.org::*Dashboard][Dashboard:4]]
:hook (server-after-make-frame . dashboard-refresh-buffer)
)
;; Dashboard:4 ends here

;; Basic Evil
