.config/emacs/config.el
;; Since I'm a long-time Neovim user, I use evil mode in Emacs.
;; Also, as I installed ~scroll-on-jump~ above, hints for jump commands are added to ensure smooth jumping.
;; This does not work for ~G~ for some reason.

;; Additionally, I use ~Space~ as my leader key.
;; This has to be set for both ~normal~ and ~visual~ mode.

;; [[file:config.org::*Basic Evil][Basic Evil:1]]
(use-package evil
  :custom
  (evil-want-integration t)  ;; these are necessary for evil-collection
  (evil-want-keybinding nil)
  :init
  (evil-mode 1)
  :config
  (scroll-on-jump-advice-add evil-undo)
  (scroll-on-jump-advice-add evil-redo)
  (scroll-on-jump-advice-add evil-jump-item)
  (scroll-on-jump-advice-add evil-jump-forward)
  (scroll-on-jump-advice-add evil-jump-backward)
  (scroll-on-jump-advice-add evil-ex-search-next)
  (scroll-on-jump-advice-add evil-ex-search-previous)
  (scroll-on-jump-advice-add evil-forward-paragraph)
  (scroll-on-jump-advice-add evil-backward-paragraph)
  (scroll-on-jump-advice-add evil-goto-mark)
  (scroll-on-jump-advice-add evil-next-line)
  (scroll-on-jump-advice-add evil-previous-line)

  ;; Actions that themselves scroll
  (scroll-on-jump-with-scroll-advice-add evil-goto-line)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-down)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-up)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-line-to-center)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-line-to-top)
  (scroll-on-jump-with-scroll-advice-add evil-scroll-line-to-bottom)
  (scroll-on-jump-with-scroll-advice-add recenter-top-bottom)
  (scroll-on-jump-with-scroll-advice-add evil-goto-first-line)

  ;; set Space as leader key
  (evil-set-leader (list 'normal 'visual) (kbd "SPC"))
  )
;; Basic Evil:1 ends here

;; Keybinds
;; Since many packages don't support ~Evil~ by default, [[https://github.com/emacs-evil/evil-collection][evil-collection]] defines keymaps defined by the community for a lot of modes.

;; [[file:config.org::*Keybinds][Keybinds:1]]
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init)
  )
;; Keybinds:1 ends here



;; Apparently, this sometimes clashes with my choice of ~SPC~ for leader, but we'll see.

;; For ~org-mode~, I'll use [[https://github.com/Somelauw/evil-org-mode][evil-org]].

;; [[file:config.org::*Keybinds][Keybinds:2]]
(use-package evil-org
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)
  )
;; Keybinds:2 ends here

;; Avy
;; In Neovim, I used [[https://github.com/ggandor/leap.nvim][ggandor/leap.nvim]] for jumping around.
;; In Emacs, this functionality is provided by [[https://github.com/abo-abo/avy][avy]].
;; We can jump everywhere (other windows, not other frames) with ~s~, make all text grey for easier jumping and change some colors.

;; [[file:config.org::*Avy][Avy:1]]
(use-package avy
  :custom
  (avy-style 'pre)
  (avy-all-windows t)
  (avy-background t)
  :config
  (avy-setup-default)
  (define-key evil-normal-state-map (kbd "s") 'avy-goto-char-2)
  :custom-face
  (avy-lead-face
   ((t
     :foreground ,(alist-get 'green catppuccin-mocha-colors)
     :background nil
     :bold t
     )))
  (avy-lead-face-0
   ((t
     :foreground ,(alist-get 'red catppuccin-mocha-colors)
     :background nil
     :bold t
     )))
  (avy-background-face
   ((t
     :foreground ,(alist-get 'overlay1 catppuccin-mocha-colors)))
   )
  )
;; Avy:1 ends here

;; Surround
;; Similar to Neovim's ~kylechui/nvim-surround~, I want to use ~evil-surround~ in Emacs.

;; [[file:config.org::*Surround][Surround:1]]
(use-package evil-surround
  :config
  (global-evil-surround-mode 1)
  )
;; Surround:1 ends here

;; Consult

;; [[file:config.org::*Consult][Consult:1]]
(use-package consult
  :bind (
         ("<leader> f f" . consult-find)
         ("<leader> f r" . consult-ripgrep)
         ("<leader> f p" . consult-register)
         )
  :custom
  (consult-async-min-input 0)
  )
;; Consult:1 ends here



;; The additional package [[https://github.com/gagbo/consult-lsp][consult-lsp]] can be used to query for symbols.

;; [[file:config.org::*Consult][Consult:2]]
(use-package consult-lsp
  :bind (
         ("<leader> f S" . consult-lsp-symbols)
         ("<leader> f s" . consult-lsp-file-symbols)
         ))
;; Consult:2 ends here

;; Vertico
;; Vertico changes the completion UI.
;; # TODO not completion UI but the line on the bottom...

;; [[file:config.org::*Vertico][Vertico:1]]
(use-package vertico
  :custom
  (vertico-resize t)  ; always resize the UI if necessary (i.e. grow or shrink)
  (vertico-cycle t)
  :init
  (vertico-mode)
  )
;; Vertico:1 ends here


;; The README of the package further recommends using savehist to keep the history.
;; This is not the default, unfortunately.

;; [[file:config.org::*Vertico][Vertico:2]]
(use-package savehist
  :init
  (savehist-mode)
  )
;; Vertico:2 ends here

;; Marginalia
;; Marginalia adds additional information to results in Vertico.

;; [[file:config.org::*Marginalia][Marginalia:1]]
(use-package marginalia
  :init
  (marginalia-mode)
  )
;; Marginalia:1 ends here

;; Orderless
;; Orderless makes searching easier, as one can search for multiple components which can match using different criteria.
;; While using [[https://github.com/oantolin/orderless?tab=readme-ov-file#style-dispatchers]["Style Dispatchers"]] to directly specify which component does what is possible, using simple searches is sufficient for the time being.

;; [[file:config.org::*Orderless][Orderless:1]]
(use-package orderless
  :custom
  (completion-styles '(orderless))
  (orderless-matching-styles
   '(orderless-regexp  ; search with regex; since simple searches are also valid regex, this is fine
     orderless-flex    ; fuzzy matching
                                        ;basic
     )
   )
  )
;; Orderless:1 ends here

;; Comments
;; In Neovim I originally used [[https://github.com/scrooloose/nerdcommenter][nerdcommenter]], though only a subset of its functionality.
;; However, I found the built-in Emacs functionality for comments lacking, and binding to ~<leader> c c~ did not work how I expected.
;; As such, I use [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] as replacement.

;; [[file:config.org::*Comments][Comments:1]]
(use-package evil-nerd-commenter
:bind (
("<leader> c SPC" . evilnc-comment-or-uncomment-lines) ; also works in visual mode

)
  )
;; Comments:1 ends here

;; Programming Languages
;; Brackets, braces, etc. should be automatically completed:

;; [[file:config.org::*Programming Languages][Programming Languages:1]]
(electric-pair-mode 1)
;; Programming Languages:1 ends here

;; Additional Modes
;; Emacs does not ship with a lua mode by default, so I install that.

;; [[file:config.org::*Additional Modes][Additional Modes:1]]
(use-package lua-mode
  :custom
  (lua-indent-level 2)
  )
;; Additional Modes:1 ends here

;; Treesitter
;; First of all, I use ~treesit-auto~ to highlight all languages with treesitter, if possible.
;; This may be removed in Emacs 30, as this is the default there.

;; [[file:config.org::*Treesitter][Treesitter:1]]
(use-package treesit-auto
  :config
  (global-treesit-auto-mode)
  )
;; Treesitter:1 ends here



;; Nix seems to be unsupported by the previous package, so we install ~nix-ts-mode~.
;; However, this requires the nix treesitter grammar, which seems to not work under Arch Linux.
;; Alas, I'll switch to NixOS soon.

;; [[file:config.org::*Treesitter][Treesitter:2]]
(use-package nix-ts-mode
  :mode "\\.nix\\'"
  )
;; Treesitter:2 ends here
