.config/emacs/config.org
**** Completion (company)
Completions should be detailed, though I have to test what this actually changes.
#+begin_src emacs-lisp
  (setq completions-detailed t)
#+end_src

For autocompletion, I use [[https://company-mode.github.io][company-mode]].
I also tried [[https://github.com/minad/corfu][corfu]] but it didn't play well with yasnippet.

First, I want suggestions immediately, both in time and in characters.
#+begin_src emacs-lisp
  (use-package company
    :custom
    (company-idle-delay 0)
    (company-minimum-prefix-length 1)
#+end_src

Completion should wrap around after the last result.
#+begin_src emacs-lisp
    (company-selection-wrap-around t)
#+end_src

There are also some visual improvements here.
#+begin_src emacs-lisp
    (company-tooltip-align-annotations t)
    (company-tooltip-flip-when-above t)
#+end_src

And completions should not be downcased when using dabbrev, as the capitalization of a word is usually fixed.
#+begin_src emacs-lisp
    (company-dabbrev-downcase nil)
#+end_src

Furthermore, backends have to be configured.
They are all grouped into a single list, as I want to always get all possible completions.
#+begin_src emacs-lisp
    (company-backends '((
#+end_src

The following completions are used.
Note that ~:with~ uses backends even if other backends have results and ~:separate~ keeps the order given here.
This means that any snippets come first, and then any other completions, e.g. from LSP.
- always include snippets
#+begin_src emacs-lisp
  company-yasnippet
#+end_src
- "language-aware editing based on source code parsers" -- not needed since we use LSP
#+begin_src emacs-lisp
  ;;;; company-semantic
#+end_src
- for CMakeLists.txt -- usually not needed
#+begin_src emacs-lisp
  ;;;; company-cmake
#+end_src
- the completion-at-point-function -- needed for e.g. LSP and always required
#+begin_src emacs-lisp
  :with company-capf
#+end_src
- used for Clang -- not needed
#+begin_src emacs-lisp
  ;;;; company-clang
#+end_src
- for completing relative and absolute files -- I disabled this as it is very slow and locks up Emacs
#+begin_src emacs-lisp
  ;;;; company-files
#+end_src
- looks for all symbols in the current buffer that aren't in comments or strings -- we use LSP
#+begin_src emacs-lisp
  ;;;; company-dabbrev-code
#+end_src
- for GNU Global
#+begin_src emacs-lisp
  ;;;; company-gtags
#+end_src
- for etags -- we use LSP
#+begin_src emacs-lisp
  ;;;; company-etags
#+end_src
- for programming language keywords -- we use LSP
#+begin_src emacs-lisp
  ;;;; company-keywords
#+end_src
- for Oddmuse wikis like EmacsWiki -- not needed
#+begin_src emacs-lisp
  ;;;; company-oddmuse
#+end_src
- completes words typed in the current file
#+begin_src emacs-lisp
  :with company-dabbrev
#+end_src
- completes mail addresses and such -- probably doesn't hurt to have even if I don't use email in Emacs
#+begin_src emacs-lisp
  :with company-bbdb
#+end_src
- keep any results in /this/ order
#+begin_src emacs-lisp
  :separate
  )))
#+end_src

Last, we just enable completion everywhere and setup selection of results with ~TAB~.
#+begin_src emacs-lisp
    :init
    (global-company-mode)
    (company-tng-configure-default)
    )
#+end_src

I want to see documentation quickly when choosing a completion.
For this, I use [[https://github.com/company-mode/company-quickhelp][company-quickhelp]].
#+begin_src emacs-lisp
  (use-package company-quickhelp
    :init
    (company-quickhelp-mode)
    )
#+end_src

Last, ~company~ should use fuzzy matching, which is accomplished with ~company-fuzzy~.
However, it seems to do this even without ~company-fuzzy~, and ~company-fuzzy~ also caused some issues, so let's just keep it that way.

**** LSP
LSP is very useful for supporting a lot of functionality for many languages.

For showing the signature help in a so-called /posframe/, we have to install that package first.
#+begin_src emacs-lisp
  (use-package posframe)
#+end_src

Then we can configure ~lsp-mode~.
Its major prefix is ~<leader> s~ in this case.
All language servers should be downloaded by the OS package manager, so disable that functionality.
#+begin_src emacs-lisp
  (use-package lsp-mode
    :custom
    (lsp-keymap-prefix "<leader> s")
    (lsp-enable-suggest-server-download nil)
    (lsp-signature-function 'lsp-signature-posframe)

    ;; Python
    (lsp-pylsp-plugins-autopep8-enabled nil)
    (lsp-pylsp-plugins-black-enabled nil)
    (lsp-pylsp-plugins-flake8-enabled t)
    (lsp-pylsp-plugins-flake8-max-line-length 90)
    (lsp-pylsp-plugins-jedi-completion-enabled t)
    (lsp-pylsp-plugins-jedi-definition-enabled t)
    (lsp-pylsp-plugins-jedi-hover-enabled t)
    (lsp-pylsp-plugins-jedi-references-enabled t)
    (lsp-pylsp-plugins-jedi-signature-help-enabled t)
    (lsp-pylsp-plugins-jedi-symbols-enabled t)
    (lsp-pylsp-plugins-mccabe-enabled t)
    (lsp-pylsp-plugins-pyflakes-enabled t)
    :hook (
           (python-ts-mode . lsp)
           (js-ts-mode     . lsp)
           (lua-mode       . lsp)
           (lsp-mode       . lsp-enable-which-key-integration)
           )
    )
#+end_src

For a better UI, we install ~lsp-ui~.
Though I'm not sure this is activated by default?
#+begin_src emacs-lisp
  (use-package lsp-ui
    :commands lsp-ui-mode
    )
#+end_src

Last, LSP overrides ~company-backends~ unless ~lsp-completion-provider~ is set to ~:none~:
#+begin_src emacs-lisp
  (setq lsp-completion-provider :none)
#+end_src

