.config/emacs/config.el

;; Completion (company)
;; Completions should be detailed, though I have to test what this actually changes.

;; [[file:config.org::*Completion (company)][Completion (company):1]]
(setq completions-detailed t)
;; Completion (company):1 ends here



;; For autocompletion, I use [[https://company-mode.github.io][company-mode]].
;; I also tried [[https://github.com/minad/corfu][corfu]] but it didn't play well with yasnippet.

;; First, I want suggestions immediately, both in time and in characters.

;; [[file:config.org::*Completion (company)][Completion (company):2]]
(use-package company
  :custom
  (company-idle-delay 0)
  (company-minimum-prefix-length 1)
;; Completion (company):2 ends here



;; Completion should wrap around after the last result.

;; [[file:config.org::*Completion (company)][Completion (company):3]]
(company-selection-wrap-around t)
;; Completion (company):3 ends here



;; There are also some visual improvements here.

;; [[file:config.org::*Completion (company)][Completion (company):4]]
(company-tooltip-align-annotations t)
(company-tooltip-flip-when-above t)
;; Completion (company):4 ends here



;; And completions should not be downcased when using dabbrev, as the capitalization of a word is usually fixed.

;; [[file:config.org::*Completion (company)][Completion (company):5]]
(company-dabbrev-downcase nil)
;; Completion (company):5 ends here



;; Furthermore, backends have to be configured.
;; They are all grouped into a single list, as I want to always get all possible completions.

;; [[file:config.org::*Completion (company)][Completion (company):6]]
(company-backends '((
;; Completion (company):6 ends here



;; The following completions are used.
;; Note that ~:with~ uses backends even if other backends have results and ~:separate~ keeps the order given here.
;; This means that any snippets come first, and then any other completions, e.g. from LSP.
;; - always include snippets

;; [[file:config.org::*Completion (company)][Completion (company):7]]
company-yasnippet
;; Completion (company):7 ends here


;; - "language-aware editing based on source code parsers" -- not needed since we use LSP

;; [[file:config.org::*Completion (company)][Completion (company):8]]
;;;; company-semantic
;; Completion (company):8 ends here


;; - for CMakeLists.txt -- usually not needed

;; [[file:config.org::*Completion (company)][Completion (company):9]]
;;;; company-cmake
;; Completion (company):9 ends here


;; - the completion-at-point-function -- needed for e.g. LSP and always required

;; [[file:config.org::*Completion (company)][Completion (company):10]]
:with company-capf
;; Completion (company):10 ends here


;; - used for Clang -- not needed

;; [[file:config.org::*Completion (company)][Completion (company):11]]
;;;; company-clang
;; Completion (company):11 ends here


;; - for completing relative and absolute files -- I disabled this as it is very slow and locks up Emacs

;; [[file:config.org::*Completion (company)][Completion (company):12]]
;;;; company-files
;; Completion (company):12 ends here


;; - looks for all symbols in the current buffer that aren't in comments or strings -- we use LSP

;; [[file:config.org::*Completion (company)][Completion (company):13]]
;;;; company-dabbrev-code
;; Completion (company):13 ends here


;; - for GNU Global

;; [[file:config.org::*Completion (company)][Completion (company):14]]
;;;; company-gtags
;; Completion (company):14 ends here


;; - for etags -- we use LSP

;; [[file:config.org::*Completion (company)][Completion (company):15]]
;;;; company-etags
;; Completion (company):15 ends here


;; - for programming language keywords -- we use LSP

;; [[file:config.org::*Completion (company)][Completion (company):16]]
;;;; company-keywords
;; Completion (company):16 ends here


;; - for Oddmuse wikis like EmacsWiki -- not needed

;; [[file:config.org::*Completion (company)][Completion (company):17]]
;;;; company-oddmuse
;; Completion (company):17 ends here


;; - completes words typed in the current file

;; [[file:config.org::*Completion (company)][Completion (company):18]]
:with company-dabbrev
;; Completion (company):18 ends here


;; - completes mail addresses and such -- probably doesn't hurt to have even if I don't use email in Emacs

;; [[file:config.org::*Completion (company)][Completion (company):19]]
:with company-bbdb
;; Completion (company):19 ends here


;; - keep any results in /this/ order

;; [[file:config.org::*Completion (company)][Completion (company):20]]
:separate
)))
;; Completion (company):20 ends here



;; Last, we just enable completion everywhere and setup selection of results with ~TAB~.

;; [[file:config.org::*Completion (company)][Completion (company):21]]
:init
(global-company-mode)
(company-tng-configure-default)
)
;; Completion (company):21 ends here



;; I want to see documentation quickly when choosing a completion.
;; For this, I use [[https://github.com/company-mode/company-quickhelp][company-quickhelp]].

;; [[file:config.org::*Completion (company)][Completion (company):22]]
(use-package company-quickhelp
  :init
  (company-quickhelp-mode)
  )
;; Completion (company):22 ends here

;; LSP
;; LSP is very useful for supporting a lot of functionality for many languages.

;; For showing the signature help in a so-called /posframe/, we have to install that package first.

;; [[file:config.org::*LSP][LSP:1]]
(use-package posframe)
;; LSP:1 ends here



;; Then we can configure ~lsp-mode~.
;; Its major prefix is ~<leader> s~ in this case.
;; All language servers should be downloaded by the OS package manager, so disable that functionality.

;; [[file:config.org::*LSP][LSP:2]]
(use-package lsp-mode
  :custom
  (lsp-keymap-prefix "<leader> s")
  (lsp-enable-suggest-server-download nil)
  (lsp-signature-function 'lsp-signature-posframe)

  ;; Python
  (lsp-pylsp-plugins-autopep8-enabled nil)
  (lsp-pylsp-plugins-black-enabled nil)
  (lsp-pylsp-plugins-flake8-enabled t)
  (lsp-pylsp-plugins-flake8-max-line-length 90)
  (lsp-pylsp-plugins-jedi-completion-enabled t)
  (lsp-pylsp-plugins-jedi-definition-enabled t)
  (lsp-pylsp-plugins-jedi-hover-enabled t)
  (lsp-pylsp-plugins-jedi-references-enabled t)
  (lsp-pylsp-plugins-jedi-signature-help-enabled t)
  (lsp-pylsp-plugins-jedi-symbols-enabled t)
  (lsp-pylsp-plugins-mccabe-enabled t)
  (lsp-pylsp-plugins-pyflakes-enabled t)
  :hook (
         (python-ts-mode . lsp)
         (js-ts-mode     . lsp)
         (lua-mode       . lsp)
         (lsp-mode       . lsp-enable-which-key-integration)
         )
  )
;; LSP:2 ends here



;; For a better UI, we install ~lsp-ui~.
;; Though I'm not sure this is activated by default?

;; [[file:config.org::*LSP][LSP:3]]
(use-package lsp-ui
  :commands lsp-ui-mode
  )
;; LSP:3 ends here



;; Last, LSP overrides ~company-backends~ unless ~lsp-completion-provider~ is set to ~:none~:

;; [[file:config.org::*LSP][LSP:4]]
(setq lsp-completion-provider :none)
;; LSP:4 ends here

;; Snippets
