.config/emacs/config.org
**** Snippets
There are a variety of snippet engines available.
I'm using [[][yasnippet]] and the associated [[][collection]] of snippets.
https://kristofferbalintona.me/posts/202202270056/
#+begin_src emacs-lisp
  (use-package yasnippet
    :init
    (yas-global-mode)
    )

  (use-package yasnippet-snippets)
#+end_src

# **** Corfu
# https://kristofferbalintona.me/posts/202202270056/

#     The TAB-and-Go style from https://github.com/minad/corfu/wiki doesn't really work with orderless, apparently?

# #+begin_src emacs-lisp
#   (use-package corfu
#     :custom
#     (corfu-cycle t)
#     (corfu-auto t)
#     (corfu-auto-delay 0)  ; this may be slow
#     (corfu-auto-prefix 2)
#     (corfu-quit-no-match t)
#     (corfu-quit-at-boundary 'separator)
#     (corfu-preview-current t)
#     (corfu-preselect 'prompt)
#     (corfu-separator ?\s)
#     (completion-styles '(orderless))
#     (tab-always-indent 'complete)
#     (completion-cycle-threshold nil)
#     (lsp-completion-provider :none)
#     :bind
#     (:map corfu-map
#           ("TAB" . corfu-next)
#           ([tab] . corfu-next)
#           ("S-TAB" . corfu-previous)
#           ([backtab] . corfu-previous)
#           )
#     :hook (lsp-completion-mode . my/corfu-setup-lsp)
#     :config
#     ;; setup lsp to use corfu for lsp completion
#     (defun my/corfu-setup-lsp ()
#       "Use orderless completion style with lsp-capf instead of the default lsp-passthrough."
#       (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
#             '(orderless)))
#     (global-corfu-mode)
#     (corfu-popupinfo-mode)

#     (set-face-attribute 'corfu-popupinfo nil :font "Iosevka-9")

#     )
# #+end_src

# In addition to ~corfu~ we need [[https://github.com/minad/cape][cape]] to be able to use e.g. ~yasnippet~.
# #+begin_src emacs-lisp
#   (use-package cape)
# #+end_src
# #+begin_src emacs-lisp
#   (use-package kind-icon
#     :after corfu
#     :config
#     (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
#   )
# #+end_src

# **** Snippets
# There are a variety of snippet engines available.
# I'm using [[][yasnippet]] and the associated [[][collection]] of snippets.
# https://kristofferbalintona.me/posts/202202270056/
# #+begin_src emacs-lisp
#   (use-package yasnippet
#     :init
#     (yas-global-mode)
#     )

#   (use-package yasnippet-snippets)
#   (use-package yasnippet-capf
#     :after cape
# ;   :hook
# ;   (emacs-lisp-mode . my/yasnippet-capf-h)
# ;   (python-base-mode . my/yasnippet-capf-h)
# ;   (python-ts-mode . my/yasnippet-capf-h)
#     )
# #+end_src

# **** Combining multiple ~completion-at-point-functions~
# Unfortunately, some modes override ~completion-at-point-functions~, effectively disabling e.g. yasnippet or cape.
# To fix this, the addition of the relevant hooks has to be done /after/ the mode has been loaded.
# #+begin_src emacs-lisp
#                                           ;(defalias 'my-capfs
#                                           ;  (cape-capf-super #'yasnippet-capf
#                                           ;                   #'cape-dabbrev
#                                           ;                   #'cape-elisp-block
#                                           ;                   ;;  #'cape-file  ; too slow
#                                           ;                   ;;  #'cape-history
#                                           ;                   ;;  #'cape-keyword
#                                           ;                   ;;  #'cape-tex
#                                           ;                   ;;  #'cape-sgml
#                                           ;                   ;;  #'cape-rfc1345
#                                           ;                   ;;  #'cape-abbrev
#                                           ;                   ;;  #'cape-dict
#                                           ;                   ;;  #'cape-elisp-symbol
#                                           ;                   ;;  #'cape-line
#                                           ;                   ))

#                                           ; (defun my/setup-lsp ()
#                                           ;   (setq-local completion-at-point-functions
#                                           ;               (list ('my-capfs
#                                           ;                      #'lsp-completion-at-point))
#                                           ;               )
#                                           ;   )
#   (add-hook 'lsp-after-open-hook
#             (lambda
#               (setq-local completion-at-point-functions
#                           (list
#                            '(cape-capf-super #'yasnippet-capf
#                                             #'cape-dabbrev)
#                            );#'lsp-completion-at-point)
#                           )
#               )
#             )
# #+end_src

# But this still doesn't work...


*** LaTeX
Even after university I still occasionally write documents using LaTeX.
The relevant configuration is from:
- [[https://michaelneuper.com/posts/efficient-latex-editing-with-emacs/][Michael Neuper]].
- [[https://tex.stackexchange.com/questions/106130/set-up-synctex-with-emacs-docview]]

The built-in PDF viewer is a little barebones and doesn't support e.g. synctex.
I attempted to replace it with [[https://github.com/vedang/pdf-tools][pdf-tools]].
The necessary ~epdfinfo~ server is supplied when installing from NonGNU ELPA or MELPA, but I don't know what happens under NixOS.
#+begin_src emacs-lisp
  (use-package pdf-tools
    :config
    (pdf-tools-install))
#+end_src

Emacs provides some nice out-of-box options for LaTeX, so the following keybinds are relevant:
#+begin_src emacs-lisp
  (define-key evil-normal-state-map (kbd "<leader> l l") (lambda() (interactive) (save-buffer) (TeX-command-run-all nil)))
  (define-key evil-normal-state-map (kbd "<leader> l v") (lambda () (interactive) (save-buffer) (TeX-view)))
  (define-key evil-normal-state-map (kbd "<leader> l s") (lambda () (interactive) (save-buffer) (pdf-sync-forward-search)))
  ;; TODO PDF clean
  ;; TODO continuous compilation
#+end_src

Everybody seems to use AUCTeX, so let's install that.
#+begin_src emacs-lisp
  (use-package auctex
    :custom
#+end_src

There are some interesting options for ~auctex~:
#+begin_src emacs-lisp
  (TeX-auto-save t)
  (TeX-parse-self t)
  (TeX-save-query nil) ;; obviously we want to compile when I ask it to, and this usually creates files, duh.
  (TeX-source-correlate-method '( ;; technically this is the default
                                 (dvi . source-specials)
                                 (pdf . synctex)
                                 ))
  (TeX-source-correlate-mode t)
  (TeX-view-program-selection '(
                                ((output-dvi has-no-display-manager) "dvi2tty")
                                ((output-dvi style-pstricks) "dvips and gv")
                                (output-dvi "xdvi")
                                (output-pdf "PDF Tools")
                                (output-html "xdg-open")
                                ))
#+end_src

Additionally, ~LaTeX-math-mode~ offers inserting some characters more easily using ~`~ and ~reftex-mode~ helps with the ToC.
#+begin_src emacs-lisp
  :hook
  (LaTeX-mode . LaTeX-math-mode)
  (reftex-mode . LaTeX-math-mode)

#+end_src
I also found that AUCTeX uses a variable-width font for headings and such, which I don't like.
#+begin_src emacs-lisp
  :custom-face
  (font-latex-sectioning-5-face
   ((t
     :inherit fixed-pitch
     :foreground ,(alist-get 'yellow catppuccin-mocha-colors)
     )))
  )
#+end_src

[[*Visuals][Similar]] to ~org-mode~, I'd like to see pretty symbols when I'm not in insert mode.
#+begin_src emacs-lisp
  (add-hook 'evil-insert-state-entry-hook (lambda () (prettify-symbols-mode -1)))
  (add-hook 'evil-insert-state-exit-hook  (lambda () (prettify-symbols-mode t)))
#+end_src

Automatic detection of the main file, similar to Neovim does not work at the moment.
Some hints can be found [[https://stackoverflow.com/questions/29728875/auctex-and-master-file-by-means-of-latexmain-file-such-as-in-vim-latex][here]].

At some point I also should enable automatic compilation.
See e.g. [[https://emacs.stackexchange.com/questions/45263/how-to-auto-compile-latex-source-file-and-auto-revert-pdf-output-buffer][here]].

*** Lilypond
When having ~lilypond~ installed at the system level, we just have to ~require~ it.
#+begin_src emacs-lisp
  (require 'lilypond-mode)
  (add-to-list 'auto-mode-alist '("\\.ly\\'" . LilyPond-mode))
  (setq LilyPond-pdf-command "zathura")
#+end_src

The highlighting is actually quite bad regarding lyrics.
I should fix that at some point.
#+begin_src LilyPond
  \addlyrics{
  \override LyricText.font-size = #'-1
  \set stanza = "1. "
  Sind die Lich -- ter
  an -- ge -- zün -- det,
}
#+end_src


** Git
Since I use Git quite often, I want to see its highlighting on the left.
In Neovim I used [[https://github.com/lewis6991/gitsigns.nvim][gitsigns.nvim]] for that.
In Emacs, I use [[https://github.com/dgutov/diff-hl][diff-hl]].
#+begin_src emacs-lisp
  (use-package diff-hl
    :config
    (global-diff-hl-mode)
    )
#+end_src

*** Magit
Magit is another interesting package for managing git in Emacs.
#+begin_src emacs-lisp
  (use-package magit)
#+end_src

For integration with ~diff-hl~, we have to add the following hooks:
#+begin_src emacs-lisp
  (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
#+end_src
* Org Mode
I use org mode for this file as well as other documentation stuff.
It is included by default in Emacs, but some additional configuration is nice.
I used these sources while writing this:
- https://zzamboni.org/post/beautifying-org-mode-in-emacs/
- ...

** Fonts
For some time I tried to use variable-pitch fonts in org-mode.
However, this caused visual issues with autocompletion or line numbers.
#+begin_src emacs-lisp
  ; (add-hook 'org-mode-hook 'variable-pitch-mode)
#+end_src

  
