.config/emacs/config.el
;; There are a variety of snippet engines available.
;; I'm using [[][yasnippet]] and the associated [[][collection]] of snippets.
;; https://kristofferbalintona.me/posts/202202270056/

;; [[file:config.org::*Snippets][Snippets:1]]
(use-package yasnippet
  :init
  (yas-global-mode)
  )

(use-package yasnippet-snippets)
;; Snippets:1 ends here

;; LaTeX
;; Even after university I still occasionally write documents using LaTeX.
;; The relevant configuration is from:
;; - [[https://michaelneuper.com/posts/efficient-latex-editing-with-emacs/][Michael Neuper]].
;; - [[https://tex.stackexchange.com/questions/106130/set-up-synctex-with-emacs-docview]]

;; The built-in PDF viewer is a little barebones and doesn't support e.g. synctex.
;; I attempted to replace it with [[https://github.com/vedang/pdf-tools][pdf-tools]].
;; The necessary ~epdfinfo~ server is supplied when installing from NonGNU ELPA or MELPA, but I don't know what happens under NixOS.

;; [[file:config.org::*LaTeX][LaTeX:1]]
(use-package pdf-tools
  :config
  (pdf-tools-install))
;; LaTeX:1 ends here



;; Emacs provides some nice out-of-box options for LaTeX, so the following keybinds are relevant:

;; [[file:config.org::*LaTeX][LaTeX:2]]
(define-key evil-normal-state-map (kbd "<leader> l l") (lambda() (interactive) (save-buffer) (TeX-command-run-all nil)))
(define-key evil-normal-state-map (kbd "<leader> l v") (lambda () (interactive) (save-buffer) (TeX-view)))
(define-key evil-normal-state-map (kbd "<leader> l s") (lambda () (interactive) (save-buffer) (pdf-sync-forward-search)))
;; TODO PDF clean
;; TODO continuous compilation
;; LaTeX:2 ends here



;; Everybody seems to use AUCTeX, so let's install that.

;; [[file:config.org::*LaTeX][LaTeX:3]]
(use-package auctex
  :custom
;; LaTeX:3 ends here



;; There are some interesting options for ~auctex~:

;; [[file:config.org::*LaTeX][LaTeX:4]]
(TeX-auto-save t)
(TeX-parse-self t)
(TeX-save-query nil) ;; obviously we want to compile when I ask it to, and this usually creates files, duh.
(TeX-source-correlate-method '( ;; technically this is the default
                               (dvi . source-specials)
                               (pdf . synctex)
                               ))
(TeX-source-correlate-mode t)
(TeX-view-program-selection '(
                              ((output-dvi has-no-display-manager) "dvi2tty")
                              ((output-dvi style-pstricks) "dvips and gv")
                              (output-dvi "xdvi")
                              (output-pdf "PDF Tools")
                              (output-html "xdg-open")
                              ))
;; LaTeX:4 ends here



;; Additionally, ~LaTeX-math-mode~ offers inserting some characters more easily using ~`~ and ~reftex-mode~ helps with the ToC.

;; [[file:config.org::*LaTeX][LaTeX:5]]
:hook
(LaTeX-mode . LaTeX-math-mode)
(reftex-mode . LaTeX-math-mode)
;; LaTeX:5 ends here


;; I also found that AUCTeX uses a variable-width font for headings and such, which I don't like.

;; [[file:config.org::*LaTeX][LaTeX:6]]
:custom-face
(font-latex-sectioning-5-face
 ((t
   :inherit fixed-pitch
   :foreground ,(alist-get 'yellow catppuccin-mocha-colors)
   )))
)
;; LaTeX:6 ends here



;; [[*Visuals][Similar]] to ~org-mode~, I'd like to see pretty symbols when I'm not in insert mode.

;; [[file:config.org::*LaTeX][LaTeX:7]]
(add-hook 'evil-insert-state-entry-hook (lambda () (prettify-symbols-mode -1)))
(add-hook 'evil-insert-state-exit-hook  (lambda () (prettify-symbols-mode t)))
;; LaTeX:7 ends here

;; Lilypond
;; When having ~lilypond~ installed at the system level, we just have to ~require~ it.

;; [[file:config.org::*Lilypond][Lilypond:1]]
(require 'lilypond-mode)
(add-to-list 'auto-mode-alist '("\\.ly\\'" . LilyPond-mode))
(setq LilyPond-pdf-command "zathura")
;; Lilypond:1 ends here

;; Git
;; Since I use Git quite often, I want to see its highlighting on the left.
;; In Neovim I used [[https://github.com/lewis6991/gitsigns.nvim][gitsigns.nvim]] for that.
;; In Emacs, I use [[https://github.com/dgutov/diff-hl][diff-hl]].

;; [[file:config.org::*Git][Git:1]]
(use-package diff-hl
  :config
  (global-diff-hl-mode)
  )
;; Git:1 ends here

;; Magit
;; Magit is another interesting package for managing git in Emacs.

;; [[file:config.org::*Magit][Magit:1]]
(use-package magit)
;; Magit:1 ends here



;; For integration with ~diff-hl~, we have to add the following hooks:

;; [[file:config.org::*Magit][Magit:2]]
(add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
(add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
;; Magit:2 ends here

;; Fonts
;; For some time I tried to use variable-pitch fonts in org-mode.
;; However, this caused visual issues with autocompletion or line numbers.

;; [[file:config.org::*Fonts][Fonts:1]]
; (add-hook 'org-mode-hook 'variable-pitch-mode)
;; Fonts:1 ends here

;; Visuals
