.config/emacs/config.org
** Visuals
Let's hide any annoying markup markers first.
Also, entities like ~\pi~ should be shown in UTF-8.
This may be weird when using subscripts like in ~snake_case~, so we set ~org-use-sub-superscripts~ to ~{}~.
Furthermore, we use ~…~ instead of ~...~ for folded headings.
#+begin_src emacs-lisp
  (setq org-hide-emphasis-markers t)
  (setq org-pretty-entities t)
  (setq org-use-sub-superscripts "{}")
  (setq org-ellipsis "…")
#+end_src

Sometimes I embed images.
To be able to set the width if desired, the following has to be set:
#+begin_src emacs-lisp
  (setq org-image-actual-width nil)
#+end_src

Since editing text with ~org-hide-emphasis-markers~ set to true is harder, we want to disable it in insert mode.
While this was supposed to work with ~org-appear~, it did not for me.
As such, I just wrote my own hooks.
#+begin_src emacs-lisp
  (add-hook 'evil-insert-state-entry-hook (lambda () (visible-mode t)))
  (add-hook 'evil-insert-state-exit-hook  (lambda () (visible-mode -1)))
#+end_src

Automatically indenting text according to the outline is also useful.
#+begin_src emacs-lisp
  (setq org-startup-indented t)
#+end_src

Furthermore, we can replace the dashes of lists with dots.
While I still use ~org-modern~ below, bullets are not correctly applied in my case.
#+begin_src emacs-lisp
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))
                             ))
                          )
#+end_src

Similarly, heading markers can be replaced.
I originally used ~org-bullets~ for this, but ~org-superstar-mode~ seems more current.
However, ~org-modern~ does all of this and more, so I used that eventually.
#+begin_src emacs-lisp
                                          ; (use-package org-superstar
                                          ;   :config
                                          ;   (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
                                          ; )
#+end_src

~org-modern~ is used like so:
#+begin_src emacs-lisp
  (use-package org-modern
    :config
    (global-org-modern-mode)
    )
#+end_src

** Org-Roam
[[https://github.com/org-roam/org-roam][Org-roam]] is a way of non-hierarchical note-taking (Zettelkasten).
#+begin_src emacs-lisp
  (use-package org-roam
    :custom
    (org-roam-directory (file-truename "~/Documents/Notizen"))
    (org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    :config (org-roam-db-autosync-mode)
    :bind (
           ("<leader> r c" . org-roam-capture)
           ("<leader> r f" . org-roam-node-find)
           )
    )
#+end_src

For a visualization of notes similar to Obsidian, I use [[https://github.com/org-roam/org-roam-ui][org-roam-ui]].
#+begin_src emacs-lisp
  (use-package org-roam-ui
    :after org-roam
    :custom
    (org-roam-ui-sync-theme t)
    (org-roam-ui-follow t)
    (org-roam-ui-update-on-save t)
    (org-roam-ui-open-on-start t)
    )
#+end_src

** Org-Download
I sometimes want to easily add pictures from the internet to my notes.
This can be accomplished with [[https://github.com/abo-abo/org-download][org-download]].
#+begin_src emacs-lisp
  (use-package org-download)
#+end_src

* Additional Plugins
** Which-Key
In neovim I used ~folke/which-key.nvim~ which makes finding new functionality easier.
A similar package exists for Emacs, which is included in Emacs starting with v30.
#+begin_src emacs-lisp
  (use-package which-key
    :config
    (which-key-mode)
    ;; this does not work with `<leader>`
    (which-key-add-key-based-replacements
      "SPC f"     "Find..."
      "SPC f f"   "file"
      "SPC f p"   "register"
      "SPC f r"   "line (ripgrep)"
      "SPC f s"   "symbols (file)"
      "SPC f S"   "symbols (project)"

      "SPC c"     "Comment..."
      "SPC c SPC" "toggle"

      "SPC l"     "LaTeX..."
      "SPC l l"   "compile"
      "SPC l v"   "view"
      "SPC l s"   "forward search"

      "SPC r"     "Org-Roam..."
      "SPC r c"   "capture"
      "SPC r f"   "find note"

      "SPC s"     "LSP..."
      "SPC s ="     "format..."
      "SPC s = ="     "buffer"
      "SPC s = r"     "region"

      "SPC s F"     "folders..."
      "SPC s F a"     "add"
      "SPC s F b"     "blocklist remove"
      "SPC s F r"     "remove"

      "SPC s G"     "peek..."
      "SPC s G g"     "definitions"
      "SPC s G r"     "references"

      "SPC s T"     "toggle..."
      "SPC s T D"     "modeline diagnostics"
      "SPC s T L"     "trace IO"
      "SPC s T S"     "sideline mode"
      "SPC s T a"     "modeline code actions"
      "SPC s T b"     "breadcrumbs"
      "SPC s T d"     "documentation"
      "SPC s T h"     "symbol highlighting"
      "SPC s T l"     "LSP Lens"
      "SPC s T s"     "automatic signatures"

      "SPC s a"     "LSP x..."
      "SPC s a a"     "lsp-execute-code-action"
      "SPC s a h"     "lsp-document-highlight"
      "SPC s a l"     "lsp-avy-lens"

      "SPC s g"     "goto..."
      "SPC s g g"     "definitions"
      "SPC s g r"     "references"

      "SPC s h"     "quickhelp..."
      "SPC s h g"     "glance documentation"
      "SPC s h h"     "show documentation"
      "SPC s h s"     "type signature"

      "SPC s r"     "refactor..."
      "SPC s r o"     "organize imports"
      "SPC s r r"     "rename"

      "SPC s w"     "LSP..."
      "SPC s w D"     "disconnect"
      "SPC s w d"     "show session information"
      "SPC s w q"     "shutdown"
      "SPC s w r"     "restart"
      "SPC s w s"     "start"

      )
    :custom
    (which-key-prefix-prefix "") ;; unfortunately, one cannot set a suffix like ...
    )
#+end_src
